.emacs.d/pauls_functions.org
* Opening file in other window from counsel-find-file
NOT DONE YET
Normally, when in counsel-find-file hitting =RET= runs =ivy-done=, which exits
the minibuffer with the selected candidate. Let's define a variant of this
function which opens it in another window.
#+BEGIN_SRC emacs-lisp
  (defun message-this-window ()
  (interactive)
  (message "%s" (selected-window)))
  (global-set-key (kbd "<C-return>") `message-this-window)

  ;; (defun ivy-done ()
  ;;   "Exit the minibuffer with the selected candidate."
  ;;   (interactive)
  ;;   (if (ivy--prompt-selected-p)
  ;;       (ivy-immediate-done)
  ;;     (setq ivy-current-prefix-arg current-prefix-arg)
  ;;     (delete-minibuffer-contents)
  ;;     (cond ((or (> ivy--length 0)
  ;;                ;; the action from `ivy-dispatching-done' may not need a
  ;;                ;; candidate at all
  ;;                (eq this-command 'ivy-dispatching-done))
  ;;            (ivy--done (ivy-state-current ivy-last)))
  ;;           ((memq (ivy-state-collection ivy-last)
  ;;                  '(read-file-name-internal internal-complete-buffer))
  ;;            (if (or (not (eq confirm-nonexistent-file-or-buffer t))
  ;;                    (equal " (confirm)" ivy--prompt-extra))
  ;;                (ivy--done ivy-text)
  ;;              (setq ivy--prompt-extra " (confirm)")
  ;;              (insert ivy-text)
  ;;              (ivy--exhibit)))
  ;;           ((memq (ivy-state-require-match ivy-last)
  ;;                  '(nil confirm confirm-after-completion))
  ;;            (ivy--done ivy-text))
  ;;           (t
  ;;            (setq ivy--prompt-extra " (match required)")
  ;;            (insert ivy-text)
  ;;            (ivy--exhibit)))))
#+END_SRC

#+RESULTS:
: message-this-window

* Not asking for confirmation upon compiling latex
not used
#+BEGIN_SRC emacs-lisp
    (defvar TeX-command-default "LaTeX"
      "The default command for `TeX-command' in the current major mode.")
    ;; (setq TeX-command-default )

(defun TeX-command-master (&optional override-confirm)
      "Run command on the current document.

    If a prefix argument OVERRIDE-CONFIRM is given, confirmation will
    depend on it being positive instead of the entry in `TeX-command-list'."
      (interactive "P")
      ;; (save-buffer); edits won't automatically show otherwise
      (TeX-command "LaTeX"
                   'TeX-master-file override-confirm))

#+END_SRC

#+RESULTS:
: TeX-command-master

#+BEGIN_SRC emacs-lisp


#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
    ;; (defun TeX-command-master (&optional override-confirm)
    ;;       "Run command on the current document.

    ;;     If a prefix argument OVERRIDE-CONFIRM is given, confirmation will
    ;;     depend on it being positive instead of the entry in `TeX-command-list'."
    ;;       (interactive "P")
    ;;       ;; (save-buffer); edits won't automatically show otherwise
    ;;       (TeX-command TeX-command-default              ;
    ;;                    'TeX-master-file nil))

  ;; (defun TeX-command-master (&optional override-confirm)
  ;;         "Run command on the current document.

  ;;       If a prefix argument OVERRIDE-CONFIRM is given, confirmation will
  ;;       depend on it being positive instead of the entry in `TeX-command-list'."
  ;;         (interactive "P")
  ;;         ;; (save-buffer); edits won't automatically show otherwise
  ;;         (TeX-command TeX-command-default              ;
  ;;                      'TeX-master-file nil))

#+END_SRC
#+RESULTS:

* Going to logic dir
#+BEGIN_SRC emacs-lisp
(defun courses  ()
(interactive)
(setq default-directory "/home/paul/courses/s2/")
)
(defun projects  ()
(interactive)
(setq default-directory "/home/paul/projects/")
)
(defun quanti  ()
(interactive)
(setq default-directory "/home/paul/projects/quanti")
)

(defun modal  ()
(interactive)
(setq default-directory "/home/paul/courses/s1_modal_logic")
)
(defun lolaco  ()
(interactive)
(setq default-directory "/home/paul/Dropbox/courses/s1_logic_language_computation/")
)
(defun gcvenn  ()
(interactive)
(setq default-directory "/home/paul/projectjes/gcvenn/")
)

(defun it  ()
(interactive)
(setq default-directory "/home/paul/courses//s1_information_theory/")
)
#+END_SRC

#+RESULTS:
: it

** Computational Complexity
#+BEGIN_SRC emacs-lisp
(defun coco-site () (interactive)
       (eww "https://staff.fnwi.uva.nl/r.dehaan/complexity2020/"))
(defun coco-mode ()
  (interactive)
  (let* (
         (hw-dir "/home/paul/courses/s2/coco/hw/")
         (file-dir "/home/paul/courses/s2/coco/files/")
         (hw-files (seq-filter (lambda (f) (and (string-prefix-p "hw" f)
                                                (string-suffix-p "solutions.tex" f)))
                               (directory-files hw-dir)))
         (hw-solutions-file-tex "take-home.tex")
         (current-hw-number (string-to-number (substring hw-solutions-file-tex 2 3)))
         (hw-questions-file "take-home-exam.pdf")
         (hw-solutions-file-pdf (concat (file-name-sans-extension
                                         hw-solutions-file-tex) ".pdf")))
    (message (concat hw-dir hw-solutions-file-tex))
    (message (concat file-dir hw-questions-file))
    (call-interactively 'delete-other-windows)
    (call-interactively 'split-window-right)
    (find-file (concat hw-dir hw-solutions-file-tex))
    (find-file-other-window (concat file-dir hw-questions-file))
    (pdf-view-fit-height-to-window)
    (pdf-view-enlarge 1.90)
    (call-interactively 'split-window-below)
    (find-file-other-window (concat hw-dir hw-solutions-file-pdf))
    (pdf-view-fit-height-to-window)
    (pdf-view-enlarge 1.90)
    (call-interactively 'other-window)))
;; (defun coco-mode ()
;;   (interactive)
;;   (let* (
;;          (hw-dir "/home/paul/courses/s2/coco/hw/")
;;          (file-dir "/home/paul/courses/s2/coco/files/")
;;          (hw-files (seq-filter (lambda (f) (and (string-prefix-p "hw" f)
;;                                                 (string-suffix-p "solutions.tex" f)))
;;                                (directory-files hw-dir)))
;;          (hw-solutions-file-tex (-max-by (lambda (a b) (> (string-to-number(substring a 2 3)) (string-to-number(substring b 2 3)))) hw-files))
;;          (current-hw-number (string-to-number (substring hw-solutions-file-tex 2 3)))
;;          (hw-questions-file (format "hw%s.pdf"  current-hw-number))
;;          (hw-solutions-file-pdf (concat (file-name-sans-extension hw-solutions-file-tex) ".pdf"))
;;          )
;;     (message (concat hw-dir hw-solutions-file-tex))
;;     (message (concat file-dir hw-questions-file))
;;     (call-interactively 'delete-other-windows)
;;     (call-interactively 'split-window-right)
;;     (find-file (concat hw-dir hw-solutions-file-tex))
;;     (find-file-other-window (concat file-dir hw-questions-file))
;;     (pdf-view-fit-height-to-window)
;;     (pdf-view-enlarge 1.90)
;;     (call-interactively 'split-window-below)
;;     (find-file-other-window (concat hw-dir hw-solutions-file-pdf))
;;     (pdf-view-fit-height-to-window)
;;     (pdf-view-enlarge 1.90)
;;     (call-interactively 'other-window)

;;     )
;;   )



  ;;   (-max-by (lambda (a b) (= (string-to-number(substring a 3 4)) (string-to-number(substring b 3 4)))) hw-files)
  ;; (find-file "/home/paul/projects/gcvenn/genes/static/js/base.js")
  ;; (shell)
  ;; (end-of-buffer)
  ;; (sit-for 1)
  ;; (comint-send-input)
  ;; (insert "cd /home/paul/projects/gcvenn")
  ;; (comint-send-input)
  ;; (sit-for 1)
  ;; (insert "python manage.py runserver")
  ;; (comint-send-input)
  ;; (indium-launch)
  ;; )
(defun coco-site () (interactive)
(eww "https://staff.fnwi.uva.nl/r.dehaan/complexity2020/"))

(defun tda-site ()
  (interactive)
(eww "https://www2.cs.duke.edu/courses/fall06/cps296.1/"))
#+END_SRC

#+RESULTS:
: tda-site

#+BEGIN_SRC emacs-lisp
(defun diremacs ()
(interactive)
(setq default-directory "/home/paul/.emacs.d/")
)
#+END_SRC

#+RESULTS:
: diremacs

* venv
obsolete, use =venv=
#+BEGIN_SRC emacs-lisp
  ;; (defun org-venv-brug ()
  ;;     (interactive)
  ;;     (setq org-babel-python-command "/home/paul/.virtualenvs/bruggeman/bin/python"))
#+END_SRC

#+RESULTS:

* ssh-ing into old laptop
#+BEGIN_SRC emacs-lisp
(defun paul ()
      (interactive)
      (setq default-directory "/ssh:paul@31.20.232.17:"))
#+END_SRC

#+RESULTS:
: paul





#+END_SRC

