.emacs.d/pauls_functions.el

(defun fp-unfill-paragraph (&optional justify region)
  (interactive (progn
         (barf-if-buffer-read-only)
         (list (if current-prefix-arg 'full) t)))
  (interactive)
  (let ((fill-column 100000))
    (fill-paragraph justify region)))

(global-set-key "\C-ceu" 'fp-unfill-paragraph)

(defun my-delete-surrounded-delimiters ()
  (interactive)
  ;; save where region begins & ends
  (let ((beginning (region-beginning))
        (end (region-end)))
        (save-excursion
        (goto-char end)
        (delete-char -1)
        (goto-char beginning)
        (delete-char 1))))

(defun my-move-region-inwards ()
  (interactive)
  ;; save where region begins & ends
  (let ((beginning (region-beginning))
        (end (region-end)))
    (save-excursion
      (goto-char (+ beginning 1))
      (set-mark)
      (goto-char (- end 1))
      (goto-char (+ beginning 1))
          ;; (delete-char -1)

          ;; (goto-char beginning)
          ;; (delete-char 1)
          )))

(global-set-key (kbd "C-M-<backspace>") `my-delete-surrounded-delimiters)
(global-set-key (kbd "C-M-r") `my-move-region-inwards)

;; (eq (string-to-syntax "(") 4)

;;       ;; (= (first (string-to-syntax "("))  4)
;;   (char-syntax (string-to-char "$"))
;;     ;; (syntax-code "{")
;; (kbd "C-M-<Backspace>")
;; (kbd "C-DEL")
(not (seq-contains `(40 36) (char-syntax (string-to-char "{"))))

(defun coco-load-files () (interactive)
       (let ((default-directory "/home/paul/courses/s2/coco/"))
             (async-shell-command "bash ~/courses/s2/coco/get_files.sh")))

(defun gcvenn-mode ()
  (interactive)
  (venv-workon "gcvenn")
  (find-file "/home/paul/projects/gcvenn/genes/static/js/base.js")
  (shell)
  (end-of-buffer)
  (sit-for 1)
  (comint-send-input)
  (insert "cd /home/paul/projects/gcvenn")
  (comint-send-input)
  (sit-for 1)
  (insert "python manage.py runserver")
  (comint-send-input)
  (indium-launch)
  )

(defun transip ()
  (interactive)
  (setq default-directory "/ssh:paul@149.210.193.148:"))
(defun plekje-transip ()
  (interactive)
  (setq default-directory "/ssh:paul@37.97.129.188:"))
(defun plekje-sfs ()
  (interactive)
  (setq default-directory "/ssh:paul@37.97.145.128:"))
(defun su-plekje-sfs ()
  (interactive)
  (setq default-directory "/ssh:paul@37.97.145.128|sudo:37.97.145.128:"))
(defun su-transip ()
  (interactive)
(setq default-directory "/ssh:paul@149.210.193.148|sudo:149.210.193.148:")
)
  ;; (setq default-directory "/ssh:paul@149.210.193.148/"))
(defun su-plekje-transip ()
  (interactive)
  (setq default-directory "/ssh:paul@37.97.129.188|sudo:37.97.129.188:"))

(defun phone ()
  (interactive)
  (setq default-directory "/ssh:paul@10.14.18.66:"))

(defun matrix-cookbook () (interactive) (eww "https://www.math.uwaterloo.ca/~hwolkowi/matrixcookbook.pdf")
       )
